<a href="https://colab.research.google.com/github/nerthiga/Introduction_to_SQL_Udacity/blob/main/Quiz5_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
SELECT RIGHT(website,3) AS website, COUNT(*) AS num_website
FROM accounts
GROUP BY 1
ORDER BY 2;

In [ ]:
SELECT LEFT(UPPER(name), 1) AS letter, COUNT(*) AS num_companies
FROM accounts
GROUP BY 1
Order BY 2;

In [ ]:
SELECT SUM(num) nums, SUM(letter) letters
FROM 
(SELECT name, CASE WHEN LEFT(UPPER(name),1) IN ('0','1','2','3','4','5','6','7','8','9') THEN 1 ELSE 0 END AS num,
CASE WHEN LEFT(UPPER(name),1) NOT IN ('0','1','2','3','4','5','6','7','8','9') THEN 1 ELSE 0 END AS letter
FROM accounts)query;

In [ ]:
SELECT SUM(vowel) vowel, SUM(non_vowel) non_vowel
FROM (SELECT name, CASE WHEN LEFT(UPPER(name),1) IN ('A','E','I','O','U') THEN 1 ELSE 0 END AS vowel, CASE WHEN LEFT(UPPER(name),1) NOT IN ('A','E','I','O','U') THEN 1 ELSE 0 END AS non_vowel
FROM accounts)query;

In [ ]:
SELECT LEFT(primary_poc, STRPOS(primary_poc, ' ') -1 ) first_name, 
RIGHT(primary_poc, LENGTH(primary_poc) - STRPOS(primary_poc, ' ')) last_name
FROM accounts;

In [ ]:
SELECT name, LEFT(name, POSITION(' ' IN name)-1) AS first_name, RIGHT(name, LENGTH(name)- POSITION(' ' IN name)) AS last_name
FROM sales_reps;

In [ ]:
SELECT primary_poc, CONCAT(first_name,'.',last_name,'@',name,'.com') AS email_address
FROM
  (SELECT primary_poc, name, LEFT(primary_poc, STRPOS(primary_poc,' ')-1) AS first_name, RIGHT(primary_poc, LENGTH(primary_poc)-STRPOS(primary_poc,' ')) AS last_name
  FROM accounts)query;

In [ ]:
SELECT primary_poc, CONCAT(first_name,'.',last_name,'@',REPLACE(name,' ',''),'.com') AS email_address
FROM
  (SELECT primary_poc, name, LEFT(primary_poc, STRPOS(primary_poc,' ')-1) AS first_name, RIGHT(primary_poc, LENGTH(primary_poc)-STRPOS(primary_poc,' ')) AS last_name
  FROM accounts)query;

In [ ]:
WITH t1 as (SELECT primary_poc, name, LEFT(primary_poc, STRPOS(primary_poc,' ')-1) AS first_name, RIGHT(primary_poc, LENGTH(primary_poc)-STRPOS(primary_poc,' ')) AS last_name
  FROM accounts)
                                                   SELECT first_name, last_name, CONCAT(first_name, '.', last_name, '@', name, '.com'), LEFT(LOWER(first_name), 1) || RIGHT(LOWER(first_name), 1) || LEFT(LOWER(last_name), 1) || RIGHT(LOWER(last_name), 1) || LENGTH(first_name) || LENGTH(last_name) || REPLACE(UPPER(name), ' ', '') AS password
FROM t1;

In [ ]:
SELECT *
FROM sf_crime_data
LIMIT 10;

In [ ]:
SELECT date AS original_date, (SUBSTR(date,7,4)||'-'||LEFT(date,2)||'-'||SUBSTR(date, 4,2)) AS formatted_date, (SUBSTR(date,7,4)||'-'||LEFT(date,2)||'-'||SUBSTR(date, 4,2))::DATE AS cleaned_date           
FROM sf_crime_data;

In [ ]:
SELECT *
FROM accounts a
LEFT JOIN orders o
ON a.id = o.account_id
WHERE o.total IS NULL;